//
//  NewsKeywords.swift
//
//  Created by Ji hyuk Song on 22/11/20.
//

import SwiftUI

class NewsKeywords: ObservableObject {
    @Published var keywords = ["양적긴축", "카카오 주식" ,"인플레이션", "경제지표", "자산배분", "연준", "코스피", "나스닥", "기술주", "주식시장", "스태그플레이션", "기준금리", "유럽 증시", "뉴욕 증시", "이더리움", "비트코인", "이더리움 머지", "금리인상", "월스트리트저널", "JP모건", "다우존스", "S&P500", "펀드매니저 예측", "머스크", "전기차", "테슬라", "반도체", "헤지펀드", "액티브 펀드", "부동산 투자", "리츠 ETF", "대기업 채용", "공기업 채용", "리츠", "채권", "장기채권", "잭슨홀 미팅"]
    
    @Published var stockKeywords = ["코스피", "나스닥", "기술주", "주식시장", "S&P500", "다우존스", "머스크", "테슬라", "반도체", "리츠 ETF", "대기업 채용", "삼성전자", "sk하이닉스", "카카오 주식", "현대차", "셀트리온", "바이오주", "워런 버핏", "성장주", "가치주", "배당주", "실적발표", "액티브 펀드", "헤지펀드", "장기채권", "채권", "자산배분"]
    
    @Published var cryptoCurrencyKeywords = ["이더리움", "비트코인", "이더리움 머지", "코인베이스", "대체불가토큰", "비트코인 ETF", "비트코인 나스닥", "엘살바도르 비트코인", "리플", "비트코인 인플레이션", "비트코인 금리인상", "비트코인 연준"]
    
    @Published var macroeconomicKeywords = ["스태그플레이션", "양적긴축", "인플레이션", "기준금리", "유럽 증시", "금리인상", "금리인하", "파월 의장", "뉴욕 증시", "fomc 금리발표", "경제지표", "PCE 지수", "CPI 지수", "GDP 발표", "고용률", "비농업고용지수", "칩4", "미중무역분쟁", "달러환율", "바이든 세금", "실업률", "인플레이션 감축법", "PPI 지수", "CSI 지수"]
}
